Catalogs/ЛМ_КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛМ_Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЛМ_ЯзыкиИнтерфейсаОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЛМ_ЯзыкиИнтерфейсаОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Русский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Украинский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛМ_КонтактныеЛица/Ext/ObjectModule.bsl
Перем НеОбновлятьВИССлужбыДоставки Экспорт;

Процедура ОбновитьКонтактноеЛицоВИССлужбыДоставки() Экспорт
	Если НеОбновлятьВИССлужбыДоставки = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Сообщить("Не указан контрагент");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Владелец.ГУИД) тогда
		Сообщить("В указанном контрагенте не заполнен идентификатор");
		Отказ = Истина;
	КонецЕсли;	
	
	Если Владелец.ЮрФизЛицо<>Владелец.ЮрФизЛицо.ГУИД="Organization" Тогда
		Если НЕ ЗначениеЗаполнено(СокрЛП(Имя)) тогда
			Сообщить("Не указано имя");
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СокрЛП(Фамилия)) тогда
			Сообщить("Не указана фамилия");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Телефон) тогда
		Сообщить("Не указан номер телефона");
		Отказ = Истина;
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
		
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "ContactPerson");
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураЗапроса.Вставить("calledMethod", "update");
	Иначе	
		СтруктураЗапроса.Вставить("calledMethod", "save");
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CounterpartyRef", Владелец.ГУИД);
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураПараметров.Вставить("Ref", ГУИД);
	КонецЕсли;
	СтруктураПараметров.Вставить("Phone", Телефон);
	
	ДоступныхСимволов = 50;
	
//	Если Владелец.ЮрФизЛицо<>Владелец.ЮрФизЛицо.ГУИД="Organization" Тогда
		СтруктураПараметров.Вставить("FirstName", Лев(СокрЛП(Имя),ДоступныхСимволов));
		ДоступныхСимволов = ДоступныхСимволов - 1 - СтрДлина(СтруктураПараметров.FirstName);
		Если ДоступныхСимволов < 0 Тогда
			ДоступныхСимволов = 0;
		КонецЕсли;	
		СтруктураПараметров.Вставить("LastName", Лев(СокрЛП(Фамилия),ДоступныхСимволов));
		ДоступныхСимволов = ДоступныхСимволов - 1 - СтрДлина(СтруктураПараметров.LastName);
		Если ДоступныхСимволов < 0 Тогда
			ДоступныхСимволов = 0;
		КонецЕсли;	
		СтруктураПараметров.Вставить("MiddleName", ЛЕВ(СокрЛП(Отчество),ДоступныхСимволов));
//	КонецЕсли;	
	
	СтруктураЗапроса.Вставить("methodProperties", СтруктураПараметров);
	Если Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Получить() = Перечисления.ЛМ_ЯзыкиИнтерфейсаОбмена.Украинский Тогда
		СтруктураЗапроса.Вставить("language", "ua");
	Иначе
		СтруктураЗапроса.Вставить("language", "ru");
	КонецЕсли;
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтруктураОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ПолучитьСтруктуруОтвета(ДеревоОтвета, Истина);
	
	Если СтруктураОтвета.Свойство("Ref") И СтруктураОтвета.Ref <> ГУИД Тогда
		ГУИД = СтруктураОтвета.Ref;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("Ошибки") Тогда
		Ошибки = СтруктураОтвета.Ошибки;
		Для Каждого КлючЗнач Из Ошибки Цикл
			Сообщить(КлючЗнач.Ключ + ": " + КлючЗнач.Значение, СтатусСообщения.Важное);
		КонецЦикла;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Наименование) И СтруктураОтвета.Свойство("Description") тогда
		Наименование = СтруктураОтвета.Description;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ)
	ОбновитьКонтактноеЛицоВИССлужбыДоставки();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГУИД = "";
КонецПроцедуры
